const lenny = channel => {

	const lennies = [
		'( ͡° ͜ʖ ͡°)',
		'̿̿ ̿̿ ̿̿ ̿\'̿\'\̵͇̿̿\з= ( ▀ ͜͞ʖ▀) =ε/̵͇̿̿/’̿’̿ ̿ ̿̿ ̿̿ ̿̿',
		'( ͡°( ͡° ͜ʖ( ͡° ͜ʖ ͡°)ʖ ͡°) ͡°)',
		'(▀̿Ĺ̯▀̿ ̿)',
		'༼ つ ◕_◕ ༽つ',
		'¯\\_(ツ)_/¯',
		'▄︻̷̿┻̿═━一',
		'(ง ͠° ͟ل͜ ͡°)ง',
		'ಠ_ಠ',
		'(ง\'̀-\'́)ง',
		'( ͡°╭͜ʖ╮͡° )',
		'(͡ ͡° ͜ つ ͡͡°)',
		'(☞ﾟ∀ﾟ)☞',
		'(☞ﾟヮﾟ)☞ ☜(ﾟヮﾟ☜)',
		'( ͡ᵔ ͜ʖ ͡ᵔ )',
		'~(˘▾˘~)',
		'☜(⌒▽⌒)☞',
        '୧༼ ಠ益ಠ ༽୨',
        '(⊙_◎)',
        '(ಥ_ʖಥ)',
        '(◕‿◕✿)',
        '♬♩♪♩ヽ༼ ˘ل͜ ˘ ༽ﾉ♬♩♪♩',
        'ヽ༼, ͡X ͜ʖ ͡X,༽ﾉ',
        '(•̀⌓•́)シ༼★ل͜★༽',
        '🍔ԅ( ͒ ۝ ͒ )',
        '━╤デ╦︻(▀̿̿Ĺ̯̿̿▀̿ ̿)',
        '┬┴┬┴┤ ͡° ͜ʖ ͡°)├┬┴┬┴ ',
        '(ノ#-_-)ノ ミ　┴┴',
        '( ♥ ͜ʖ ♥)',
        '( ͡~ ͜ʖ ͡°)'
	];

	const randNum = Math.floor(Math.random() * lennies.length);
	const lennyFace = lennies[randNum];

	channel.send(`${lennyFace}`);
	return;
};

module.exports = lenny;
